# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные

a = 10
print(type(a))

a = 'Any string'
print(type(a))

a = 4 / 5 * 2
print(type(a))

a = True
print(type(a))