# Задание №3
# ✔ Напишите функцию, которая открывает на чтение созданные в прошлых задачах файлы с числами и именами.
# ✔ Перемножьте пары чисел. В новый файл сохраните имя и произведение:
# ✔ если результат умножения отрицательный, сохраните имя записанное строчными буквами и произведение по модулю
# ✔ если результат умножения положительный, сохраните имя прописными буквами и произведение округлённое до целого.
# ✔ В результирующем файле должно быть столько же строк, сколько в более длинном файле.
# ✔ При достижении конца более короткого файла, возвращайтесь в его начало.


# file_end_1 = False
# file_end_2 = False
# while file_end_1 and file_end_2:
#     if f1.readline() = "":
#         file_end_1 = True

# from typing import TextIO
#
#
# def read_by_line(file: TextIO):
#     test = file.readline()
#     if not test:
#         file.seek(0)
#         test = file.readline()
#
#     return test[:-1]

